#
# 学校作业为啥不纳入知识.org ?
# 因为根据我长久的经验，学校作业一般是侵入式的，不完整的，甚至有些（很多）科目，其实就是混学分用的，这时候一般追求最短时间内，总结归纳，完成任务。
# 所以，有了这个 org

# 优先级, 信息很多，我该怎么做呢？我该怎么做呢？信息很多，我该怎么做呢？我该怎么做呢？
# 一般来说，学校作业的优先级会稍微高于知识，因为一般要把事件录入 org 的时候，说明已经处于赶作业的状态了

* 散
** DONE [#B] 请教老师软件工程的问题
SCHEDULED: <2022-12-06 Tue> DEADLINE: <2022-12-06 Tue 18:00>


** DONE [#C] 早上去桌子学习, 试试体验
DEADLINE: <2022-12-10 Sat 08:00> SCHEDULED: <2022-12-10 Sat>


* 学校实习
** LOOP [#B] 泰迪云线上课堂
SCHEDULED: <2022-12-10 Sat> DEADLINE: <2022-12-15 Thu>
- [ ] <2022-12-11 Sun 21:01> / 120 分钟 / 入门 /
---------


** TASK [#B] 小组实战项目 ???
----------


* 作业
** DONE 课后实验：安卓
DEADLINE: <2022-10-19 Wed 12:00>


** DONE 课后实验1-6: 软件定义网络
DEADLINE: <2022-10-21 Fri>
通过链接上交


** DONE 课后实验1-6: 无线定义网络
DEADLINE: <2022-10-21 Fri>


** 软件工程
*** DONE 软件工程大纲
DEADLINE: <2022-09-15 Thu 12:36> SCHEDULED: <2022-09-15 Thu 10:35>
https://weread.qq.com/web/reader/b6e32290721a1238b6ed18bkc20321001cc20ad4d76f5ae
- [X] 软件过程
    - 定义
        1. 软件过程规定了完成各项任务的工作步骤
        2. 软件工作模型（软件生命周期模型）是一种划分方法，用来描述软件过程。
          : 软件工程采用的生命周期方法学就是从时间角度对软件开发和维护的复杂问题进行分解，把软件生存的漫长周期依次划分为若干个阶段，每个阶段有相对独立的任务，然后逐步完成每个阶段的任
    - [X] 步骤
        - [X] 问题定义
        - [X] 需求开发
        - [X] 软件开发
        - [X] 软件构造
        - [X] 软件测试
- [X] 软件过程模型（软件生命周期模型） (描述方法)
  软件过程模型是对软件过程的抽象描绘，用于描述软件开发全过程。
    - [X] 瀑布模型
      瀑布模型把软件开发划分为独立的子阶段，每个阶段线性地顺序执行。
    - [X] 原型法模型
      瀑布模型借鉴了制造业，但是软件开发是一个创造的过程，随着开发，会有新的想法，新的需求，这是瀑布模型的缺陷。原型法模型是怎么做的呢？先实现一个原型，然后在其的基础上完善。
    - [X] 迭代式模型
      从前的软件开发，从编写文档到系统实现需要若干年，客户有耐心等待。但是现在什么都要快。
      迭代式模型，每隔段时间（2-3个星期）就要进行实现一次局部子系统（必须包含完整的需求分析，编码，测试等步骤）。

      随着时间发展，系统一次一次迭代，增量式地迭代与发展。
    - [X] 可转换模型
    - [X] 敏捷开发
        - [X] 极限编程
          让客户直接和开发人员在一起，降低需求的变更成本
        - [X] 并列争球法
          天天开会？
        - [X] 水晶法
          最重要的人（之间的交流？），适合多个人数少的小组
        - [X] 动态系统开发方法
        - [X] 特征驱动开发
          划分特征
        - [X] 自适应软件开发
          设立一个目标作为指导，但是不描述如何达到目标


*** DONE 软件工程作业之 jsd 层次结构图（也叫 jackon 图） 
https://max.book118.com/html/2018/0618/173309862.shtm
  - [X] 定义
    面向数据结构的设计方法（用数据结构作为）
    - [X] 数据结构的逻辑关系
      - [X] 顺序
      - [X] 选择
      - [X] 重复
  - [X] 方法
    - [X] 找出输入输出结构 && 根据逻辑关系画出 *描述数据结构的 Jackson 图* （根据上述数据结构的逻辑关系）
    - [X] 把 *描述数据结构的 jackson 图* 转化为 *描述程序结构的 jackson* 图
      - 方法：
	查找 *两边输入输出之间存在的动态流程*
      - [X] 如何查找输入输出之间的动态流程
	1. 按照 *层次模块* 顺序往下套
	2. 找到明确的输入输出两边之间对应有关系的数据单元，按照数据单元最低的层次进行处理。
    - [X] 操作表
      - [X] 添加操作
      - [X] 为操作添加输入框
  - [X] 图形
    从上到下，方块组成


*** DONE 组内自评



* 期末考试
** DONE 科技文献检索实验报告
- 实验报告
  - 课题选型与分析
    - 课题名称：
    - 课题分析
      随着 5G 技术的发展，以及光纤的全面普及，以前很多网络的瓶颈问题得到了解决。
      因为以前的传统的网络端游的延迟问题，只能采取 udp 多次传输小包的方式进行同步，现在能使用 tcp 传输图像，就好像急促的小溪流变成了大运河。

      另一方面，随着游戏画质的提高和旧的端游常年累月的更新补丁，游戏越发的臃肿，几十 GB 设置上百 GB 的大小，随便下几个游戏，硬盘就满了。
      游戏种类更多的同时，也再往快餐化的方向发展，没有人愿意会花 1 整天的时间和几十GB 的流量下载一个游戏，就玩了一会，就卸载了。或者我只是偶尔玩玩，一不小心就把硬盘塞满了。

      幸运的是，我认为云游戏平台的出现能够解决这个问题，它会给玩家一个很低的成本进行试错，同时能够满足电脑瘦身的需求。
    - 要解决的问题（通过文献检索结合分析问题）
      1. 研究云游戏的目前普及以及可行性
      2. 中国有哪些成功的项目
      3. 目前还面临哪些技术问题
      4. 增长检索经验
- 检索策略
    - 检索思路
      发展的苗头 -> 行业应用 -> 分析原因 -> 未来趋势
    - 检索词
      云游戏
    - 检索工具： (图书管检索，论文检索，期刊检索等任选一）
      | 中国知网数据库 | https://kns.cnki.net/kns8/defaultresult/index                                 |
      | 中国知网数据库 | https://kns.cnki.net/kns8?dbcode=BDZK                                         |
      | 中国知网数据库 | https://kns.cnki.net/kns8/DefaultResult/Index?dbcode=BDZK&kw=云游戏&korder=SU |
      | 中国知网数据库 | https://kns.cnki.net/kns8/DefaultResult/Index?dbcode=BDZK&kw=云游戏&korder=SU |
- 检索步骤与结果分析
    - 使用检索工具（步骤：带截图）
      检索词：云游戏
      检索步骤：通过知网学术期刊的高级检索工具进行检索，检索式为“主题=云游戏”，并且“主题=”，检索结果如图所示

      - 图书检索
	检索词：云游戏
	检索步骤：使用中国知网的图书检索工具，检索式为“主题=云游戏“，检索结果如图所示：

      - 学位论文检索
	检索词：云游戏
	检索步骤：使用中国知网的图书检索工具，检索式为“主题=云游戏“，检索结果如图所示：
      - 专利文献检索
      - 会议论文检索
      - 标注文献检索
      - 科技报告检索

    - 检索结果分析：
      通过知网期刊共检索出 537 篇文献，其中有用文献的 12 条，通过这些文献的阅读、分析与总结，
      发现云游戏非常普遍，米哈游，腾讯都在这些地方发力，但是还有很多问题，GPU 透传的串流协议还不成熟。
      以及建设成本的问题。

      - 图书检索
	通过知网图书共检索外文图书 4 本，中文图书 0 本。说明我国在这方面的技术没有外国成熟，依旧没有得到普及

      - 学位论文检索
	通过知网硕士论文共有 26 个结果，而且年份都是集中在 20-22 年，说明云游戏越来越火

      - 专利文献检索
	通过知网硕士文献共有 1549 个结果，专利几种在抖音，腾讯等大厂，说明社会对云游戏的需求和实用性是实在的

      - 会议检索
	通过知网共检索会议 13 个结果

      - 标注文献检索
	0 ，说明是刚刚起步，还处于摸石头过河的阶段，无论行业还是国家缺少一个标准

      - 科技报告
	通过知网期刊共检索出 1910 篇文献，其中有用文献的 20 条，通过这些文献的阅读、分析与总结，
        发现云游戏非常普遍

    - 列出检索的文献（有格式要求）
      [1]面向未来,IP RAN网络优化思路探讨[A]. 刘雁斌,陈烈强,曾雯.2018中国信息通信大会论文摘要集[C]. 2018
      [2]移动社会化网络业务发展趋势和商业模式探讨[A]. 周宇煜.2007年中国通信学会“移动增值业务与应用”学术年会论文集[C]. 2007

      [1]阿里巴巴云游戏PaaS平台的设计与实现[J]. 郭旷野,宋扬.  广播与电视技术. 2021(07)
      [2]论云计算平台即服务PaaS架构的研究与设计[J]. 王秀珍.  中国新通信. 2017(19)
      [3]云计算环境安全综述[J]. 张玉清,王晓菲,刘雪峰,刘玲.  软件学报. 2016(06)

      [1]Cloud gaming: architecture and performance. [J] . Ryan Shea,Jiangchuan Liu,Edith C. H. Ngai,Yong Cui 0001.  IEEE Network . 2013 (4)
- 科技文献索引心得体会
    无


** 软件工程
*** DONE 软件工程演示
DEADLINE: <2022-11-01 Tue 09:40> SCHEDULED: <2022-11-01 Tue 08:05>


*** DONE [#B] 交补修表和像学委打听事情（是否规范）
DEADLINE: <2022-12-02 Fri> SCHEDULED: <2022-12-01 Thu>


** DONE 劳动周
DEADLINE: <2022-11-16 Wed> SCHEDULED: <2022-11-09 Wed 10:05>
:LOGBOOK:
CLOCK: [2022-11-22 Tue 15:11]--[2022-11-22 Tue 17:08] =>  1:57
CLOCK: [2022-11-21 Mon 15:59]--[2022-11-21 Mon 18:00] =>  2:01
CLOCK: [2022-11-09 Wed 14:32]--[2022-11-09 Wed 15:51] =>  1:19
CLOCK: [2022-11-09 Wed 12:36]--[2022-11-09 Wed 12:48] =>  0:12
CLOCK: [2022-11-09 Wed 12:07]--[2022-11-09 Wed 12:32] =>  0:25
CLOCK: [2022-11-09 Wed 10:12]--[2022-11-09 Wed 11:05] =>  0:53
:END:
- [X] 报告要求
    - [X] 华为新产品，解决什么问题 (从技术的角度看华为）
        - [X] 操作系统： Openeuler
          openEuler是一款开源操作系统。 当前openEuler内核源于Linux，支持鲲鹏及其它多种处理器，能够充分释放计算芯片的潜能，是由全球开源贡献者构建的高效、稳定、安全的开源操作系统，适用于数据库、大数据、云计算、人工智能等应用场景。
        - [X] 毕草编译器：助力多样算力编程编译
          毕昇C++编程语言以C++为基础，支持多样性计算的异构编程标准，实现使用一种语言即可对鲲鹏、昇腾AI等业界主流算力进行编程，大大降低了多样性计算系统的编程复杂性和学习成本。此外，毕昇C++编程语言在支持通用语言规范的同时，还提供了统一矩阵编程、内存数据移动及向量化编程接口等扩展。
          毕昇融合编译器实现了鲲鹏、昇腾AI等多算力的融合统一编译优化。通过编译算法优化及与处理器架构深度协同，加强了自动向量化、循环优化和多面体优化等能力，标准Benchmark峰值性能提升30%。
          当前毕昇C++编程语言结合毕昇编译器，已与10多所高校研究机构在开展飞机噪声仿真、湍流仿真、地震模拟等多领域多样算力应用开发。基于鲲鹏加昇腾AI多样性计算架构实现了飞机噪声仿真，并实现开发效率翻倍提升，10+倍混合精度求解性能提升。
          面向未来，华为将携手更多的高校、机构和开发者，共同推动基础软件产业，共同繁荣中国兼容开放的基础软件生态。
        - [X] opengauss
            - [X] 介绍
              openGauss是一款开源关系型数据库管理系统，采用木兰宽松许可证v2发行。openGauss内核深度融合华为在数据库领域多年的经验，结合企业级场景需求，持续构建竞争力特性。
              提供面向多核架构的极致性能、全链路的业务、数据安全、基于AI的调优和高效运维的能力。openGauss深度融合华为在数据库领域多年的研发经验，结合企业级场景需求，持续构建竞争力特性。同时，openGauss也是一个开源、免费的数据库平台，鼓励社区贡献、合作。
            - [X] 使用场景
              交易型应用
              大并发、大数据量、以联机事务处理为主的交易型应用。例如，电商、金融、O2O、电信CRM/计费等类型的应用，应用可按需选择不同的主备部署模式。
              物联网数据
              传感监控设备多、采样率高、数据存储为追加模型，操作和分析并重的场景。例如，工业监控、远程控制、智慧城市的延展、智能家居、车联网等物联网场景。
        - [X] openlookeng
            - [X] 介绍
              2019年11月19日，华为宣布开源数据虚拟化引擎HetuEngine（开源版本的HetuEngine叫openHetu），今日，openHetu正式更名为openLooKeng，HetuEngine更名为LooKengEngine。openLooKeng是一款开源的高性能数据虚拟化引擎。提供统一SQL接口，具备跨数据源/数据中心分析能力以及面向交互式、批、流等融合查询场景。同时增强了前置调度、跨源索引、动态过滤、跨源协同、水平拓展等能力。
            - [X] 应用场景
              随着大数据技术的应用和发展，数据种类越来越多，数据分布越来越广，查询场景也越来越复杂，这使得大数据使用更加困难。为了改善大数据的易用性，华为发起数据虚拟化引擎openLooKeng开源项目，旨在解决上述问题：
              统一SQL接口访问多种数据源
              免数据搬迁，在数据所在地对数据进行处理，并且支持跨数据中心、跨云处理
              面向交互式、批、流等融合查询的场景（第一个版本支持交互式查询场景）
        - [X] 鲲鹏
            - [X] 鲲鹏 boostkit
                - [X] 介绍
                  鲲鹏BoostKit分布式存储使能套件以鲲鹏硬件平台为底座，依托鲲鹏硬件的自研处理器、网卡、SSD、管理芯片、AI芯片的全方位整体优势，结合开源Ceph分布式存储软件，为客户提供块存储、文件存储、对象存储服务。
                - [X] 场景
                  是一个支持独立部署、集群自管理的分布式缓存，其遵循开源Ceph框架，充分发挥鲲鹏硬件能力 ，大幅提升分布式存储系统的全栈竞争力。
            - [X] 鲲鹏 devkit
                - [X] 简介
                  全称是鲲鹏开发套件DevKit，鲲鹏开发套件提供面向全研发作业流程的迁移、开发、编译、测试、调优、诊断等能力，实现海量应用到鲲鹏平台的快速迁移和极简开发。远程实验室提供预安装鲲鹏开发套件的在线开发环境（通过邮箱申请免费鲲鹏虚拟化环境（Kunpeng 920 | 8vCPU | 16GB内存 | 200GB系统盘），环境中已经预装鲲鹏开发套件 Kunpeng DevKit。）。
                  鲲鹏开发套件 DevKit提供涵盖代码开发、编译调试、云测服务、性能分析及系统诊断等各环节的开发使能工具，方便开发者快速开发出鲲鹏亲和的高性能软件。
                - [X] 背景
                  大多数人一般都是用高级语言来开发，比如高效的C/C++，面向对象的Java和简洁优雅的Python等，在某些特殊领域可能会用到汇编，一般都不是直接编写机器码，但程序的真正运行是只认机器码的，而机器码与硬件平台息息相关，由于不同硬件采用了不同的指令集，在不同的体系架构平台上面是无法直接运行的，所以这些软件需要迁移。
                  可以看到，还是很多工作要做的，如果全都靠人工来做，工作量巨大，而且对迁移的工程师有较高的要求，对不同硬件和底层要都很熟悉才行，这就不太好了。
    - [X] 华为的贡献和未来规划（从产品的角度看华为）
      : 其实就是华为过去的业务和未来的业务
        - [X] 过去：集中在通信行业
            - [X] 5 G 之前，蓄势待发
              (1） 2005年，华为突破传统基站的模式，开发了业界第一款分布式基站，解决了站址难找、安装困难、耗电和运维成本高等一系列难题，更快、更便宜地建设移动网络。2007年，华为又在业界率先推出了SingleRAN（单一无线接入网）基站，实现2G、3G基站合一（现在可以2G、3G、4G、5G合一）……这些系列化的创新，其价值不仅仅是帮助运营商降低30%总拥有成本（TCO），更是极大地降低了网络建设的门槛，提高了建网速度。这些产品和解决方案的巨大技术和商业优势，使得欧洲厂商不得不跟随华为，也推出类似的产品，从而这些产品成了行业的事实标准并引领了无线产业的发展方向。此外，2006年华为与沃达丰（Vodafone）公司建立了第一个联合创新中心，真正从客户战略、产品方案、商业模式、产业发展等各方面与客户深度合作创新，牵引客户需求，共同解决行业面临的挑战和难题，实现商业成功。发展到今天，华为与客户和合作伙伴建立了遍及全球的36个联合创新中心。
              (2） 围绕着全球技术要素及资源，华为在全球建立了超过16个研发中心，60多个基础技术实验室，包括材料、散热、数学、芯片、光技术等。我们围绕着全球人才和资源，建立研究中心。②产业的竞争，也是产业联盟之间的竞争，而产业联盟必须是开放的、先进的。2016年4月，在时任工业和信息化部副部长怀进鹏的领导和支持下，华为发起成立了绿色计算机产业联盟，共同拓展基于ARM的绿色计算机产业，目前已有国内外50多家成员单位。③为了推动各行各业的数字化转型的进程，华为还发起成立了跨行业、跨产业的全球产业组织（Global Industry Organization，GIO），共同推动数字化转型的框架、规范、标准和节奏，从抢蛋糕到做大蛋糕，做大产业空间。
              (3） 早在1996年，华为预研部就明确要求预研费用必须占研发费用的10%以上，现在提高达到20%—30%，这意味着每年有20亿—30亿美元投入到前沿和基础技术研究。华为2018年研发费用达到150亿美元（1 000多亿元人民币），在全球所有公司中排名前5位。华为在全球现有超过8万研发人员，占总人数45%左右。我们看到的是产品，而冰山之下的核心技术才是产品竞争力的来源，包括数学、芯片设计、材料、散热等。早在1991年，华为就设计了第一片ASIC芯片，并成立了芯片设计室，也就是今天的海思半导体有限公司（以下简称“海思”）的前身。现在，海思的“麒麟990”是世界上最先进的5G手机芯片；其实早在2005年，海思就决定开发3G手机芯片了。今天看到的技术进步，都是研发长期的投入、压强原则和厚积薄发取得的。华为有60多个基础技术实验室，700多名数学博士，200多名物理学和化学博士，这些都保障了持续的技术领先。
            - [X] 5 G
              5G龙头：在2020年的全球5G标准核心必要专利数量排名（2020）上，华为获得第一，其1970件的专利数量超出第二名的诺基亚33%，甚至华为在端到端5G标准的总体贡献超过全球所有企业。“端到端”，是指华为的5G产品与技术已经实现了从无线接入、网络基础设施、到终端设备的“端到端”。在产品方面，华为发布的5G产品解决方案完全基于3GPP全球统一标准，具备“全系列、全场景、全云化”能力。在芯片方面，全球首款5G基站核心芯片——华为天罡，包括多频段、多制式在内的极简5G凝结而成。华为的5G终端芯片——巴龙5000，是一款集成度较高的5G终端芯片，实现了单芯片多模的能力，能够提供从2G到5G的支持，同时支持NSA和SA架构。在5G网络方面，截至2019年6月，华为累计发货15万个5G基站，并在全球签下50个5G商用合同，其中有28个合同分布在欧洲；同时，2019年上半年，韩国、英国、瑞士、意大利、科威特等多个国家完成5G商用发布，其中有2/3由华为协助。

              5G网络是第五代移动通信网络。 5G网络的峰值理论传输速度可达每8秒1GB，比4G网络的传输速度快数百倍。
              5G与4G相比，最大的优势在于高速率、低时延、大容量等。 比如，理论上5G网速比4G快几倍，同样的密集的商业地区，5G要比4G更快、更稳定。
              华为5G是由华为公司的技术团队发明的，这个技术是由华为主要研制的，
              随着5G技术的问世，华为在国际上的地位以及影响力也越来越高，即便美国不择手段打击，依然未能改变这一事实。
              对于我国来说，5G的到来同样具备着非同一般的意义，这是中华强大的体现，也是中国高科技正式迈入先进行列的证明，这一次没有国家能够否认中国的实力，即便是美国，想要在两三年内赶上中国也是不可能的事。如今各国要想在5G技术上不落后于中国太多，就只有一个选择，那就是与华为合作，即便是在美国的重压下，也已经有30多个国家都与华为达成了协议，可见，华为5G在国际上的发展是无法阻挡的。
              而5G的到来所带来的影响更是无所不及的，虽然我们现在并无法深刻体会到，但在未来，我们一定会看到巨大的改变，比如物联网，AR，自动驾驶等等，科技一直在进步，5G相比于4G来说，所产生的影响同样也存在巨大的不同，当时4G的到来很多人都只是停留在网络加速上，但后来所带来的变化却是一系列的，比如移动支付，短视频等等。
                  
              (1） 5 G 提高了中国的地位和给中国带来了巨大的收益
              中国移动通信技术在几十年里经历了从落后到追赶再到领先，这是一个漫长的过程。当下，凭借超前的战略布局和人才储备，我国5G在全球范围内的专利积累、标准影响力、智能硬件设备的制造以及应用场景开发等方面都具备了明显的先发优势，也为我国的5G发展夯实了基础。
              5G时代的话语权还体现在设备厂商拥有的专利数量上。数据显示，截至去年底，中国5G专利申请数量位居全球第一。其中，华为在5G专利的排名全球第一，中兴通讯则位列全球第三。根据德国专利数据公司IPLytics分析统计，截至2019年3月，中国厂商已申请的全球主要5G标准专利数量占比为34%，远远高于韩国的25%以及美国和芬兰的各14%。
              根据预测，2030年，我国5G间接拉动的GDP将增长到3.6万亿元。今年6月6日，我国正式发布5G商用牌照，基于领先技术的支持，加上全球最大的用户规模、巨大的4G网络、丰富的移动互联网应用等明显优势，我国5G商用牌照的发放可谓水到渠成。业内认为，政府高度重视、企业积极抢滩，“中国5G发展引领全球”已成必然。
        - [X] 未来：百花齐放，互联网，（骗经费项目）
            - [X] 人工智能
              华为正积极推进AI产业的基础设建设。2021世界人工智能大会期间，华为昇腾计算业务总裁许映童透露，今
              鲲鹏、昇腾是华为公司计算产业的两大核心芯片族，均是基于ARM V8永久授权架构下的自研芯片族。昇腾芯片族主要面向AI计算，包括训练和推理芯片，是华为全栈全场景AI解决方案的关键部分，也是华为落地全面AI战略的重要支撑，应用领域包括平安城市、自动驾驶、云服务和IT智能、智能制造、机器人等场景。
              目前人工智能已步入第三次发展浪潮，深度学习算法成为了此次浪潮中的代表技术，而普通的数据中心由于底层算力不足，无法满足人工智能算法运算及其业务开展的需要，已成了产业发展的第一大阻力。
              华为启动AI计算中心建设的目的便在于扩建与完善AI基础设施。许映童表示，阻碍人工智能发展的原因首先是算力贵，其次是分散建设的算力利用率不高。而政府产业引导型的计算中心扩建，产业发展和创新的诉求较强，更加适合于这种AI基础设施的大规模高投入建设。与此同时，政府在群众号召及公信影响方面的优势，也更容易让大家相信人工智能计算中心的数据安全及商业收费合规，进而充分放大人工智能计算中心建设所带来的价值。
              人工智能已连续多年被写入我国政府工作报告，“十四五”规划中，人工智能更是上升为国家战略，位列前沿科技领域的最高优先级
            - [X] 教育行业
              随着人工智能技术发展日趋成熟,教育行业正在从“教育+互联网”深化为“教育+AI”,即通过AI技术赋能,推动教育行业朝个性化发展，基于自身的软硬件优势，华为一直致力于构建全场景生态，教育作为其中一环，同样继承了华为全场景战略理念。去年4月，华为正式宣布成立华为教育中心
              教学工具方面,华为教育中心将借助AI技术协助教师进行作业批改,包括主客观题批改、口语测评等,让教师从繁重的批改工作中释放,有更多时间与精力投入对学生的针对性答疑辅导中。个性化自主学习方面,华为教育中心将通过优质题库、知识图谱、能力诊断等技术,借助AI算法分析用户学习薄弱点,制定个性化学习计划,帮助知识点查漏补缺。同时,华为教育中心借助智能图像识别技术,将上线指尖查词功能,让自主学习更高效
            - [X] 智能云网
              什么是智能云？智能云是自感知、自调度、自愈合、自进化的云计算形态。将人类解放出来，依靠云化数据中心的人工智能，实现自动化运转。
              物理设备层的运维，与传统数据中心类似。最原始的方式，是通过设备的告警指示灯了解设备状态，进行故障处理与设备维护。也可以通过云管平台监控设备管理控制器，实现平台化运维。华为eSight提供了一体化融合运维管理解决方案，可以对服务器、存储、虚拟化、交换机、路由器、WLAN、防火墙进行全面运维。
              虚拟化层的运维，由于其物理不可见的特性，需要更多的依赖工具来执行。从获取虚拟计算、虚拟存储、虚拟网络的监控参数，到阈值告警、性能监控等基础运维能力的实现，再到面向资源租户提供资源告警和监控能力，是整个云数据中心对虚拟资源的标准运维体系。华为OperationCenter工具，以及云监控服务（CES）、云审计服务（CTS）等云服务，可以提供阈值设置、故障告警和性能监控等能力，在虚拟化层实现体系化的资源运维。
              应用部署、数据迁移，通过云提供的基本服务能力，不会如应用开发那般复杂。在云数据中心，应用的部署方式有很多，基于VM的镜像部署、手工部署，基于Container的镜像部署、软件包部署，以致Serverless部署，都是可选的方案。数据迁移，可以中断业务，执行数据迁移，也可以通过旁路接入的方式，逐步引流，最终达到数据双向一致。华为提供的数据复制服务（DRS）是一种易用、稳定、高效的数据迁移工具，可以用于数据库在线迁移、实时同步等多种场景。
              在云数据中心，通过弹性伸缩能力，应用可以动态的调配占用的计算资源。但应用对资源的最小用量和最大用量应该如何给定呢？存储资源的大小又如何给定？在业务生产过程中资源的变化又会是什么样呢？目前，对这些问题只能靠粗暴计算，或者拍脑袋，来给出答案。如果把AI引入云数据中心，通过智能算法，将有能力给出更加贴合实际的答案。
    - [X] 量子通信原理，查：我国的领先技术
        - [X] 学科诞生与所属：量子通信是 *量子信息* 的一个子分类
            - [X] 量子信息的产生
                - [X] 物理学科的量子力学
                  有普朗克发现的，具有固定的能量
                - [X] 信息科学
            - [X] 量子信息分类
                - [X] 量子计算：量子计算机等
                - [X] 量子通信：
                    - [X] 量子密钥分发
                    - [X] 量子隐形传态
        - [X] 分类
            - [X] 量子密钥分发
                - [X] 用途 / 诞生背景
                    - [X] 普通加密原理不行
                      明文通过密钥变成密文，然后传输出去，接收方接收到密文后使用双方约定好的密文进行反加密，就能破解得到明文
                      但是，随着计算机算力的提升，破解密钥越来越简单。
                    - [X] 香浓说：最好的密钥是随机的
                      所以，使用量子来生成随机密钥是成了一个可行的办法
                - [X] 原理
                    - [X] 利用原子的特性
                        - [X] 测量基和光子对比
                            - [X] 如果光子属于测量基：得到确认值
                              根据光子的偏转角度得到0 或 1
                            - [X] 不属于：得到不确认值
                              光子有概率 50 % 得到0 或 1
                        - [X] 原子的不可克隆性：
                - [X] 步骤：双方确认随机密钥的步骤
                  ....
                    - [X] A 先发送一个比特串
                    - [X] A 随机选择测量基，比特串根据该测量基得到一串光子（根据测量基得到的光子是从属于测量基）
                    - [X] 把光子发送过去
                    ....
                    - [X] B 也选择随机的测量基，+ 接收到的光子 = 比特串
                    - [X] 分析比特串的结果
                        - 如果随机选择的测量基恰好和 A 的一样，则生成一样的比特
                        - 如果不是，则随机获取 0 或 1
                    ....
                    - [X] A 和 B 交互测量基，从中选择相同的比特部分，就是密钥
                - [X] 为什么不担心监听呢？
                  如果对方监听并且也用随机生成的测量基，那么会导致原子提前发生偏转，未偏转之前 A 和 B 采用相同测量基的概率是 50%，如果双方对比低于 50%，就可以判定有人监听。
        - [X]p 我国的领先技术
          量子通信，这几年发展的很猛，频繁在各大媒体中露相，引起关注，那么我国在量子通信领域的领先技术有那些呢？
            - [X] https://zhuanlan.zhihu.com/p/385683901
            - [X] https://zhuanlan.zhihu.com/p/345473434
    - [X] 激光通信和可见光通信领域有哪些新进展
      我国的光纤通信技术在发展的过程中经历了很多的波折和困难，但是随着科学的不断进步和发展，我国的光纤通信已经掌握了光纤、系统以及器件等各个方面的重要技术。我国光纤通信技术的应用和创新在国际上也是比较先进的。到目前为止，我国光纤通信的应用范围也越来越广，不仅涉及海底通信、长途干线以及局域网等，而且在国际上的应用也是非常广泛的。
      我国处在世界领域，中国科学家开发新型宽带集成激光器，实现通信与可见光的同时激射，展示三五族半导体的集成光学应用潜力. 半导体激光器在光纤通信领域的发展潜力巨大。. 得益于半导体激光 …
      三五族半导体与铌酸锂结合的最大潜力在于光通信领域，铌酸锂的电光调制功能是收发器的核心。目前，该领域的大量工作已经证明，铌酸锂作为电光调制器的性能及其价值，很多国内外团队也在进行两个平台的融合研究。“二者的集成很大程度上提升了产品性能，并且降低了成本，这对行业的发展是重大利好。”李鸣骁说。
    - [X] 我国的信息技术领域的（发展）突破和技术
      : 写个概念也行
      : 让我们了解新的趋势
        - [X] 芯片
          南京大学在下一代光电芯片制造方面取得重大突破。南京大学在自然杂志发表论文，表示已经研发出来飞秒脉冲激光极化铁电畴技术，把光雕刻铌酸锂三维结构的尺寸，从传统的 1 微米量级，一下子推进到30 纳米级别，大幅度提高了加工精度。
          同时中微半导体设备（上海）股份有限公司制造的5nm刻蚀机已完成量产准备，下半年就将交付给台积电投入使用，这是国产芯片制造产业链的又一个重大突破。
          刻蚀机正是中国在芯片制造产业链中进展最快的环节，其他环节如今才刚进展到14nm，光刻机更是还在攻坚28nm，而刻蚀机已完成7nm工艺，如今再进一步到5nm工艺，刻蚀机可谓是中国芯片制造产业链最成功的技术创新。
          眼见着成熟工艺得到芯片行业的青睐，拥有5nm等先进工艺制程的台积电如今又反过来扩张28nm工艺产能，试图与中国大陆的三大芯片制造企业竞争。但是对于芯片行业来说，先进工艺毕竟是未来，为此中国的芯片产业链仍然需要加快先进工艺的发展。
          中国在刻蚀机方面所取得的进展，证明了芯片制造设备其实并非不可突破的技术，刻蚀机的快进步将促使中国芯片产业链加速技术研发，可以预期中国的芯片制造产业链迟早能打破当下的桎梏，实现完全自主研发。
        - [X] Web3.0
          华为作为龙头，在 web3.0 作出
          Web3.0基础设施的建设离不开融合、开放、安全、易用的云计算和区块链服务。华为云区块链服务深耕区块链核心技术，不断在Web3.0基础设施建设方面进行探索实践，帮助合作伙伴高效安全地实现Web3.0转型。
          曲强说，Web3.0实际上是一个以区块链作为底层技术的平台，有很多工具可以帮助开发人员建立相关应用程序，但是过程非常复杂和困难。为了帮助开发人员优化用户体验，华为开发了具有多个特点的区块链服务，包括支持混合环境的灵活开发、模块化设计、层次化网络管理等。
          基于这个服务，用户可以很容易地建立自己的数字营销应用，例如数字版权保护、数字资产交易、数字收藏应用等。曲强用2022年北京冬季奥运会的数字雪花作为例子进行展示，“数字雪花的应用程序相当复杂，但在华为支持下，用户只花2周时间就构建完成了。”
          近两年华为的区块链服务增长很快，在多个行业已有700多个案例，这为探索不同行业如何使用区块链积累了大量的后台实践。谈到未来的目标，他说是要建立一个连接的、可信的、智能的世界。
          Web1.0时代的最大特征是平台负责组织联系内容生产者和用户，内容生产者大多为精英，用户只能浏览内容。站在普通用户的角度，也可称之为Read-Only。我们现在正身处Web2.0时代。00后的一代人可以说是伴随着Web2.0成长的，其显著特征是普通用户大量参与讨论、创作和分享，广大互联网消费者同时也是内容生产者，可以简称Read+Write。Web2.0时代诞生了大量互联网巨头和新产业，比如京东、淘宝、亚马逊、eBay网等在线购物网站，微博、微信、Facebook、Twitter等社交领域巨头，腾讯视频、爱奇艺、Netflix等在线视频巨头……借助移动通信&移动互联网&AI&大数据等技术带来的便利，Web2.0生态依然在不断扩大，例如火遍全球的短视频社交应用TikTok
        - [X] 元宇宙
          2021-2022年，元宇宙概念开始席卷全球，2021年大部分企业和个人主要是对元宇宙概念进行分享、解读和理解。2022年开始，众多相关领域开始探索元宇宙进入的可能性，元创元宇宙研究院还遇到政府部门人员，寻求元宇宙农业落地的合作企业资源，未来元宇宙成为国家战略新兴产业已经成为必然
          2021年11月，华为发布了基于Cyberverse虚实融合技术的“星光巨塔”AR交互体验APP。通过“星光巨塔”，九色神鹿可以穿越时空出现在华为园区，承载星光能量的高塔将矗立在波光粼粼的湖面上。参与者进入App就可以看到一个虚实融合的世界，收集能量、搜索宝箱、寻找NPC、占领能量塔、团战打BOSS，以取得最终的胜利。河图Cyberverse融合3D高精度地图，全场景空间计算、强环境/物体理解、虚实世界融合渲染的4项核心能力。
          元创元宇宙研究院分析，在5G网络的建设中，华为是全球当之无愧的领头羊，而在元宇宙发展的其他方面，华为也正在迎头赶上，华为开展基础研究的意志是坚决的，基于在通信领域的云计算、信息网络、技术实力、芯片实力、智能硬件等领域的领先，在中国排行榜华为元宇宙综合实力排名稳居第二。
          中国在内容与场景、协同方这两大方向有先天优势，并有望在后端基建、人工智能这两大方向奋力追赶，但硬件及操作系统、底层架构这两大方向上，中国唯有华为具备较好的资源禀赋及底层技术积累，且华为河图承载着中国“底层架构”方面的希冀。
    - [X] 结合 5 的发展，国家发展，那么我们应该怎么发展呢？
      (1） 永远也不限制自己的发展，敢于去学习新技术。
      (2） 我国在“十三五”规划纲要中，将培育人工智能、移动智能终端、第五代移动通信(5G)、先进传感器等作为新一代信息技术产业创新重点发展，拓展新兴产业发展空间。
      当前，信息技术发展的总趋势是从典型的技术驱动发展模式向应用驱动与技术驱动相结合的模式转变，信息技术发展趋势和新技术应用主要包括以下10个方面：只有这种程度吗？
        1. 高速度大容量
        2．集成化和平台化
        以行业应用为基础的，综合领域应用模型（算法）、云计算、大数据分析、海量存储、信息安全、依托移动互联的集成化信息技术的综合应用是目前的发展趋势。信息技术和信息的普及促进了信息系统平台化的发展，各种信息服务的访r结果和表现形式，与访问途径和访问路径无关，与访问设备无关，信息服务部署灵活，共享便利。信息系统集成化和平台化的特点，使得信息消费型注重良好的用户体验，而不必关心信息技术细节。
        3．智能化
        随着工业和信息化的深度融合成为我国目前乃至今后相当长的一段时期的产业政策和资金投入的主导方向，以“智能制造”为标签的各种软硬件应用将为各行各业的各类产品带来“换代式”的飞跃甚至是“革命”，成为拉动行业产值的主要方向。“智慧地球”“智慧城市”等基于位置的应用模式的成熟和推广，本质上是信息技术和现代管理理念阳环境治理、交通管理、城市治理等领域的有机渗透。
        1. 虚拟计算
            在计算机领域，虚拟化( Virtualization)这种资源管理技术，是将计算机的各种实体资源，如服务器、网络、内存及存储等，抽象、捌装、规范化并呈现出来，打破实体结构间的不可切割的障碍，使用户可以比原本的组态更好的方式来使用这些资源。这些虚拟资源不受现有资源的地域、物理组态和部署方式的限制。一般所指的虚拟化资源包括计算能力和数据存储能力。通常所说的虚拟计算，是一种以虚拟化、网络、云计算等技术的融合为核心的一种计算平台、存储平台和应用系统的共享管理技术。虚拟化已成为企业IT部署不可或缺的组成部分。一般来看，虚拟化技术主要包括服务器虚拟化、内存虚拟化、存储虚拟化、网络虚拟化、应用虚拟化及桌面虚拟化。
            在实际的生产环境中，虚拟化技术主要用来解决高性能的物理硬件产能过剩和老的旧的硬件产能过低的重组重用，透明化底层物理硬件，从而最大化地利用物理硬件。由于实际物理部署的资源由专业的技术团队集中管理，虚拟计算可以带来更低的运维成本，同时，虚拟计算的消费者可以获得更加专业的信息管理服务。虚拟计算应用于互联网上，是云计算的基础，也是云计算应用的一个主要表现，这已经是当今和未来信息系统架构的主要模式。
        2. 通信技术
           随着数字化技术构发展，通信传输向高速、大容量、长距离发展，光纤传输的激光波K从1.3微米发展到1.55微米并普遍应用。波分复用技术已经进入成熟应用阶段，光放大器代替光电转换中继器已经实用；

        可以集中精力，除了平时工作业务代码外，还要多去关注以上的这些发展
- [X] 要求
    - 蓝色提示要去掉，自己写标题
    - 3000 字
    - 必须宋体小四号
    - 注意排版
    - 字体改成黑色
    - 学号+姓名 : 18034460227+谢健安

- [ ] 手写
  创新周，我观看了华为的直播，看业界大佬通过华为了解这个世界前沿的技术，让我眼界大开。同时，我进入互联网，收集了很多华为的资料，学习华为的技术，让我获益匪浅。
  
  华为作为中国的龙头企业，科技公司，在自主芯片，服务器，操作系统，数据库领域，应用开发领域，人工智能，编译器取得了很多的成就。
  
  首先是操作系统，华为有自主研发的操作系统，那就是openEuler。当前 openEuler 内核源于Linux，支持鲲鹏及其它多种处理器，能够充分释放计算芯片的潜能，是由全球开源贡献者构建的高效、稳定、安全的开源操作系统，适用于数据库、大数据、云计算、人工智能等应用场景。
  
  毕昇C++编程语言以C++为基础，支持多样性计算的异构编程标准，实现使用一种语言即可对鲲鹏、昇腾AI等业界主流算力进行编程，大大降低了多样性计算系统的编程复杂性和学习成本。此外，毕昇C++编程语言在支持通用语言规范的同时，还提供了统一矩阵编程、内存数据移动及向量化编程接口等扩展。毕昇融合编译器实现了鲲鹏、昇腾AI等多算力的融合统一编译优化。通过编译算法优化及与处理器架构深度协同，加强了自动向量化、循环优化和多面体优化等能力，标准Benchmark峰值性能提升30%。

  openGauss是一款开源关系型数据库管理系统，采用木兰宽松许可证v2发行。openGauss内核深度融合华为在数据库领域多年的经验，结合企业级场景需求，持续构建竞争力特性。提供面向多核架构的极致性能、全链路的业务、数据安全、基于AI的调优和高效运维的能力。openGauss深度融合华为在数据库领域多年的研发经验，结合企业级场景需求，持续构建竞争力特性，交易型应用，大并发、大数据量、以联机事务处理为主的交易型应用。

  openLooKeng是一款开源的高性能数据虚拟化引擎。提供统一SQL接口，具备跨数据源/数据中心分析能力以及面向交互式、批、流等融合查询场景。同时增强了前置调度、跨源索引、动态过滤、跨源协同、水平拓展等能力。随着大数据技术的应用和发展，数据种类越来越多，数据分布越来越广，查询场景也越来越复杂，这使得大数据使用更加困难。为了改善大数据的易用性，华为发起数据虚拟化引擎openLooKeng开源项目，旨在解决上述问题：统一SQL接口访问多种数据源，免数据搬迁，在数据所在地对数据进行处理，并且支持跨数据中心、跨云处理。面向交互式、批、流等融合查询的场景（第一个版本支持交互式查询场景）。

  可以说华为开始搭建属于自己的基础架构，基础架构的方向上努力可以防止别人卡脖子。
            
  在推动我国生产力数字生产力发展方面，华为依旧是领头羊。在 5 G 华为领先世界之前，华为在通信领域已经掌握着世界的顶级技术，拥有无数的专利。

  2005年，华为突破传统基站的模式，开发了业界第一款分布式基站，解决了站址难找、安装困难、耗电和运维成本高等一系列难题，更快、更便宜地建设移动网络。2007年，华为又在业界率先推出了SingleRAN（单一无线接入网）基站，实现2G、3G基站合一（现在可以2G、3G、4G、5G合一），其价值不仅仅是帮助运营商降低30%总拥有成本（TCO），更是极大地降低了网络建设的门槛，提高了建网速度。这些产品和解决方案的巨大技术和商业优势，使得欧洲厂商不得不跟随华为，也推出类似的产品，从而这些产品成了行业的事实标准并引领了无线产业的发展方向。此外，2006年华为与沃达丰（Vodafone）公司建立了第一个联合创新中心，真正从客户战略、产品方案、商业模式、产业发展等各方面与客户深度合作创新，牵引客户需求，共同解决行业面临的挑战和难题，实现商业成功。亿美元投入到前沿和基础技术研究。而冰山之下的核心技术才是产品竞争力的来源，包括数学、芯片设计、材料、散热等。早在1991年，华为就设计了第一片ASIC芯片，并成立了芯片设计室，也就是今天的海思半导体有限公司（以下简称“海思”）的前身。现在，海思的“麒麟990”是世界上最先进的5G手机芯片；

  而到了在 5 G 时代，正式让华为领跑世界，5G标准的总体贡献超过全球所有企业。“端到端”，是指华为的5G产品与技术已经实现了从无线接入、网络基础设施、到终端设备的“端到端”。在产品方面，华为发布的5G产品解决方案完全基于3GPP全球统一标准，具备“全系列、全场景、全云化”能力。在芯片方面，全球首款5G基站核心芯片——华为天罡，包括多频段、多制式在内的极简5G凝结而成。华为的5G终端芯片——巴龙5000，是一款集成度较高的5G终端芯片，实现了单芯片多模的能力，能够提供从2G到5G的支持，同时支持NSA和SA架构。在5G网络方面，截至2019年6月，华为累计发货15万个5G基站，并在全球签下50个5G商用合同，其中有28个合同分布在欧洲；同时，2019年上半年，韩国、英国、瑞士、意大利、科威特等多个国家完成5G商用发布，其中有2/3由华为协助。

  对于我国来说，5G的到来同样具备着非同一般的意义，这是中华强大的体现，也是中国高科技正式迈入先进行列的证明，这一次没有国家能够否认中国的实力，即便是美国，想要在两三年内赶上中国也是不可能的事。如今各国要想在5G技术上不落后于中国太多，就只有一个选择，那就是与华为合作，即便是在美国的重压下，也已经有30多个国家都与华为达成了协议，可见，中国华为 5G 在国际上的发展是无法阻挡的。
                  
  面向新时代，华为不仅作出了更多的创新，除了传统的通信，开始涉猎更新的行业，如同人工智能，教育行业，智能云网。

  华为正积极推进AI产业的基础设建设。鲲鹏、昇腾是华为公司计算产业的两大核心芯片族，均是基于ARM V8永久授权架构下的自研芯片族。昇腾芯片族主要面向AI计算，包括训练和推理芯片，是华为全栈全场景AI解决方案的关键部分，也是华为落地全面AI战略的重要支撑，应用领域包括平安城市、自动驾驶、云服务和IT智能、智能制造、机器人等场景。目前人工智能已步入第三次发展浪潮，深度学习算法成为了此次浪潮中的代表技术，而普通的数据中心由于底层算力不足，无法满足人工智能算法运算及其业务开展的需要，已成了产业发展的第一大阻力。
  华为启动AI计算中心建设的目的便在于扩建与完善AI基础设施。

  华为也积极准备在教育行业开建扩图，随着人工智能技术发展日趋成熟, 教育行业正在从“教育+互联网”深化为“教育+AI”,即通过AI技术赋能,推动教育行业朝个性化发展，基于自身的软硬件优势，华为一直致力于构建全场景生态，教育作为其中一环，同样继承了华为全场景战略理念。去年4月，华为正式宣布成立华为教育中心。教学工具方面,华为教育中心将借助AI技术协助教师进行作业批改,包括主客观题批改、口语测评等。

  还有智能云网。提供了一体化融合运维管理解决方案，可以对服务器、存储、虚拟化、交换机、路由器、WLAN、防火墙进行全面运维。从获取虚拟计算、虚拟存储、虚拟网络的监控参数，到阈值告警、性能监控等基础运维能力的实现，再到面向资源租户提供资源告警和监控能力，是整个云数据中心对虚拟资源的标准运维体系。

  除了华为的技术，我也间接了解了我国的发展目标和核心技术，例如量子通信，激光通信，可见光通信，以及我国在信息技术领域的突破。

  量子通信是啥呢？ 量子通信是量子信息的一个子分类，物理学科的量子力学和信息科学组合形成了量子信息，而量子信息分为量子计算和量子通信。量子通信主要的研究问题是量子密钥分发，这解决了过去传统方式的密钥的安全问题。香浓说：最好的密钥是随机的，所以，使用量子来生成随机密钥是成了一个可行的办法。原理是利用原子的特征，测量基和光子对比，如果光子属于测量基：得到确认值。根据光子的偏转角度得到0 或 1。不属于：得到不确认值。光子有概率 50 % 得到0 或 1 和原子的不可克隆性。A 先发送一个比特串， A 随机选择测量基，比特串根据该测量基得到一串光子（根据测量基得到的光子是从属于测量基）。把光子发送过去，B 也选择随机的测量基，+ 接收到的光子 = 比特串，分析比特串的结果，如果随机选择的测量基恰好和 A 的一样，则生成一样的比特，如果不是，则随机获取 0 或 1， A 和 B 交互测量基，从中选择相同的比特部分，就是密钥。  如果对方监听并且也用随机生成的测量基，那么会导致原子提前发生偏转，未偏转之前 A 和 B 采用相同测量基的概率是 50%，如果双方对比低于 50%，就可以判定有人监听。这对我国的信息安全技术发展有着非常重要的作用。

  我国的激光通信技术处在世界领域，中国科学家开发新型宽带集成激光器，实现通信与可见光的同时激射，展示三五族半导体的集成光学应用潜力. 半导体激光器在光纤通信领域的发展潜力巨大。

  我国的信息技术领域取得很大发展突破和技术。刻蚀机正是中国在芯片制造产业链中进展最快的环节，其他环节如今才刚进展到14nm，光刻机更是还在攻坚28nm，而刻蚀机已完成7nm工艺，如今再进一步到5nm工艺，刻蚀机可谓是中国芯片制造产业链最成功的技术创新。眼见着成熟工艺得到芯片行业的青睐，拥有5nm等先进工艺制程的台积电如今又反过来扩张28nm工艺产能，试图与中国大陆的三大芯片制造企业竞争。快进步将促使中国芯片产业链加速技术研发，可以预期中国的芯片制造产业链迟早能打破当下的桎梏，实现完全自主研发。

  同时越来越多新潮的信息通信技术涌现出来。例如，Web3.0. 在 web3.0 方向上，华为依旧作为龙头，在 web3.0 作出带头作用。 Web3.0基础设施的建设离不开融合、开放、安全、易用的云计算和区块链服务。华为云区块链服务深耕区块链核心技术，不断在Web3.0基础设施建设方面进行探索实践，帮助合作伙伴高效安全地实现Web3.0转型。还有区块连，近两年华为的区块链服务增长很快，在多个行业已有700多个案例，这为探索不同行业如何使用区块链积累了大量的后台实践。谈到未来的目标，他说是要建立一个连接的、可信的、智能的世界。
  
  看了，华为的直播，联想到国家的未来发展，我思考了我应该怎么发展，我先想到了几个方面。永远也不限制自己的发展，敢于去学习新技术。
  我国在“十三五”规划纲要中，将培育人工智能、移动智能终端、第五代移动通信(5G)、先进传感器等作为新一代信息技术产业创新重点发展，拓展新兴产业发展空间。当前，信息技术发展的总趋势是从典型的技术驱动发展模式向应用驱动与技术驱动相结合的模式转变，信息技术发展趋势和新技术应用主要包括以下几个方面：1. 高速度大容量 2．集成化和平台化 3．智能化 4. 虚拟计算  5。通信领域。所以，这给了我一个方向，一个研究的方向，要想更强，不是要干体力活，而是要精，所以平时除了完成工作，还要多去关注以上的这些发展，去研究更深层次的知识。



** SDN 实训周
**** 确认路线
***** DONE 实训课题入门
DEADLINE: <2022-10-18 Tue 20:00>
: 我要先知道实训到底是做什么的
[[~/Downloads/软件定义网络实训-内容与要求.docx]]
- 题目：OpenFlow 应用与实现
- 方式：抓包
- 了解
  - 协议格式
    - Flow_mod 消息
    - Packet_in/out 消息
  - 结构
    - 拓扑
    - 组表


***** DONE SDN 入门
DEADLINE: <2022-10-18 Tue 21:00>
[[~/Downloads/软件定义网络考试知识点.docx]]


***** DONE 实验所用的工具入门
DEADLINE: <2022-10-18 Tue 21:40>
  - [X] 还没有搞定一些东西
      1. [X] Openvswitch 是不是核心
         是用软件模拟的基础设施层的设备（支持南向接口的 openflow 协议）
      2. [X]  mininet 和 opendaylight
           1. [X] 两者的关系： +替代+ ？ 协作？
           2. [X] 两者的作用
                1. opendaylight 是控制器
                2. Mininet 提供一个仿真环境，来设置网络拓扑，并且可以可视化，底层是 ovs
- [X] 开源解决方案（软件）： Openvswitch
  https://zhuanlan.zhihu.com/p/28822114
- [X] mininet
  https://blog.51cto.com/u_15060510/4056084
  Mininet 是一款轻量级的进程虚拟化网络仿真工具,其最重要的一个特点就是它的所有代码几乎可以无缝迁移到真实的硬件环境,方便为网络添加新的功能并进行相关测试
- [X] opendaylight


***** DONE 从过去的实验中找到合适的工具
DEADLINE: <2022-10-18 Tue 22:40>
确认了是 openvswitch,mininet,opendaylight



**** DONE 路线确定后，开始重点学习三个模块与他们组成的架构： openvswitch,opendaylight,mininet
DEADLINE: <2022-10-19 Wed 09:50>
- [X] SDN 架构
  - 三个层次
    - 应用层 : 用户在上层通过下层提供的接口实现功能
    - 控制层 : 把传统网络中 {控制，转发} 的控制功能剥离出来，并且提供更高的粒度。例如可以控制流量
    - 基础设施层 : 遵循 *和控制层通信协议* 的网络设备：包括路由器，交换机等。
      : 所有不是什么交换机都可以作为基础设施层
      - 厂商生成的支持 sdn 的硬件
      - 开源的，用软件模拟的虚拟机 ovs(openvswitch)
  - 层次的接口
    - 北向接口：应用层与控制层接口，具体由控制层厂商规定，只要求符合 rest 协议。
    - 南向接口：控制层与基础设施的接口，由很多选择，包括开源或厂商定制，国际的开源标准是 openflow.
...............
- [X] OpenFlow ： 南向接口的国际通信协议，下面的三个都支持这种协议
- [X] OpenVswitch ：开源的（交换机）基础设施层，
- [X] mininet     ：为底层的多个交换机提供交互网络和开关，以便建立拓扑结构，所以开启需要 openvswitch 的支持。
- [X] Opendaylight ：开源的控制层



**** 搭建环境
***** DONE 开启 opendaylight



***** DONE 开启 openvswitch 服务
- linux 的好处就出来了
  #+begin_src shell
    sudo pacman -S openvswitch
    ls /usr/lib/systemed/system/ovs*
    sudo systemctl start ovsdb-server
  #+end_src



***** DONE 开启 mn 服务


**** DONE 开始协作
https://www.sdnlab.com/sy12-opendaylight-mininet/



**** DONE 建立 mininet 拓扑 (实验4）
DEADLINE: <2022-10-19 Wed 20:30>
 - 拓扑类型
     - 基本拓扑
         - Minimal
           一个交换机下面挂着两个主机
         - 线性
         - 单一
           多个主机连接一个交换机
         - 树形
         - 星型
     - 自定义拓扑
       需要更加复杂的建立方法，脚本 hold 的住，命令行不行
         1. 能够指定 ip 地址
         2. 能够设置带宽
 - [X] 建立方式
     - [X] 命令行建立
     - [X] Python 脚本建立
     - [X] 交互式建立
       类似与 python-shell 的命令式单步执行
     - [X] 可视化建立
       : 通过 miniedit 建立，可以导出 py 脚本
         - Mininet
             1. Miniedit
             2. 画图
             3. 设置控件的属性
                  1. 控制器
	             Remote-Controller 填上 ip 地址和端口（6633？）
                  2. 主机
	             自己设置 ip 地址
                  3. 交换机
	             默认属性
             4. 设置总属性，通过 preference。
                  1. 勾选 start-cli 开启 cli 支持
                  2. 选择 openflow 协议
             5. 执行 run
             6. 导出为脚本文件
                  1. 可以关闭 x 图形，通过 cli 继续命令式



**** DONE Opendaylight 控制 mininet （实验5）


**** DONE 编译 IM 的服务器端
541:1


** 科技英语 
*** DONE [#B] 学习元音。使用最平的读法，不深挖细节，快速知道怎么读单词
DEADLINE: <2022-12-03 Sat 11:00> SCHEDULED: <2022-12-03 Sat>
:LOGBOOK:
CLOCK: [2022-12-03 Sat 10:26]--[2022-12-03 Sat 11:15] =>  0:49
:END:
- [X] 预习
    - [X] 目标：在科技英语的学习通 ‘4级核心词汇单词’ 中，我发现我不需要读的多么好，我要记住高频和其最平的元音读法，做到 8，9 不离十即可，辅音暂时不用学

    - [X] 预计时间：快速 1 小时

    - [X] 资料：
        - [X] 根据科技英语学习通的‘根据音标写出词’ 来研磨

        - [X] https://www.jiwake.com/yinbiaofayin/ 跟读音标的网站
  
- [X] 开始
    - [X] 普通
        - [X] i 字头

            - [X] 英文 e

                - [X] I

                - [X] i:

        - [X] e 字头
            - [X] 英文 at
                - [X] a
                - [X] ae

        - [X] a 字头
            - [X] 拼音 a

                - [X] ^

                - [X] a:

        - [X] 倒 e 字头

            - [X] 拼音 e

                - [X] 倒 e

                - [X] 耳：

        - [X] 倒 c 字头

            - [X] 拼音 o

                - [X] |倒 c

                - [X] 倒 c：

        - [X] U 字头

            - [X] 拼音 u

                - [X] u

                - [X] u：
                  
    - [X] 组合

-----------------------------


*** 单词 
**** DONE [#C] 知乎找到的四级词，连练手
:LOGBOOK:
CLOCK: [2022-12-01 Thu 08:55]--[2022-12-01 Thu 10:38] =>  1:43
CLOCK: [2022-12-01 Thu 01:13]--[2022-12-01 Thu 01:56] =>  0:43
CLOCK: [2022-11-30 Wed 21:17]--[2022-11-30 Wed 22:40] =>  1:23
CLOCK: [2022-11-30 Wed 13:40]--[2022-11-30 Wed 14:43] =>  0:58
CLOCK: [2022-11-30 Wed 09:14]--[2022-11-30 Wed 11:50] =>  2:36
CLOCK: [2022-11-29 Tue 19:52]--[2022-11-29 Tue 23:18] =>  3:26
:END:
- [-] 知乎 300 词  https://zhuanlan.zhihu.com/p/440011937
    - [X] 1-25 [100%]
        - [X] alter 改变
        - [X] burst 炸
        - [X] Dispose 处理，处置, 安排
        - [X] Blast 炸
        - [X] consume 消费, 消耗
        - [X] Split 分割
        - [X] spit 唾弃
        - [X] spill 填满, 溢出 
        - [X] slip 滑
        - [X] slide 滑
        - [X] breed 种类
        - [X] budget 预算 
        - [X] candidate 候选词
        - [X] campus 大学校园
        - [X] liberal 自由
        - [X] transform 转化
        - [X] Transmit 传输
        - [X] Transplant 移植
        - [X] Transport 传输
        - [X] Shift 移动
        - [X] Vary 改变
        - [X] Vanish 消失的
        - [X] Swallow 燕子, 忍受

    - [X] 26-45 [100%]
        - [X] Nuisance 讨厌的

            - [X] Annoy 厌烦

            - [X] Annoying 厌烦的

        - [X] Insignificant 无意义的

            - [X] Significant 有意义的

            - [X] Import 导入, 重要

        - [X] Suspicion 怀疑

        - [X] Suspicious 怀疑

        - [X] Mild 温柔的

            - [X] Mile 里

            - [X] Milk 牛奶

        - [X] Tender 温柔的

        - [X] Vain 徒劳的

            - [X] Pain 痛苦的

        - [X] Absolute 绝对的

            - [X] Solution 解决方案

            - [X] Evolution 进化

        - [X] Extinct 灭绝的

            - [X] Extra 多余的

            - [X] Exact 确信的

        - [X] Vague 含糊不清

        - [X] Vanish 消失 

        - [X] Dispose 处理

        - [X] Consume 消费, 消耗

        - [X] Breed 种子

        - [X] Extraordinary

        - [X] Extreme 极端的

        - [X] Agent 代理

        - [X] Appeal 呼吁  

        - [X] Approve 批准

        - [X] Acquire 获得(学分) 

        - [X] Accomplish

            - [X] Accompany

        - [X] Alcohol 

    - [X] 46 - 65 [16/16]
        - [X] tide 潮

        - [X] tidy 整齐的

        - [X] Trace 轨迹

        - [X] torture 拷打

        - [X] wander 迷失的

        - [X] wax 蜡

        - [X] weave 编排

        - [X] preserve 保护, 保存

            - [X] Prevent Prevent 预防, 避免

        - [X] abuse 滥用

            - [X] Refuse 拒绝

        - [X] academic 大学学会

        - [X] academy 大学学会

        - [X] battery 电池 

        - [X] barrier 障碍

        - [X] cargo 船只

        - [X] career 经历

        - [X] vessel 船只

    - [-] 65 - 85 [19/20]
        - [ ] Expensive

            - [ ] Experienced 有经验的

            - [ ] Experiential 经验的

            - [ ] Expert 专业的

            - [ ] Experiment 实验

            - [ ] Expend V.花费

            - [ ] Expense N.费用

        - [X] Expand 扩展

        - [X] Expend 花费

        - [X] Individual 个体

        - [X] Personal 个人的

        - [X] Personnel 个人的

        - [X] The Pacific 太平洋

        - [X] The Atlantic 大西洋

        - [X] Grant 给予, 提供 

        - [X] Grand 宏伟的, 壮观的 

        - [X] Invade 入侵

        - [X] Acid 酸

        - [X] Acknowledge 承认

        - [X] balcony 阳台

        - [X] calculate 计算

        - [X] calendar 日历

        - [X] optimise 乐观 

        - [X] optional 可选择的

        - [X] impose 强迫

        - [X] Religion 宗教

    - [-] 85 - 100 [13/23]
        - [ ] Religious

        - [ ] Victim

        - [X] Video 录像 

        - [X] Videotape 录像带

        - [X] Offend 犯罪

            - [X] Office 办公室 

            - [X] Offical 官方

            - [X] Offer 提供

                - [X] Afford 负担得起 

        - [ ] Bother 麻烦, 纠纷  

            - [ ] brother 兄弟 

        - [-] Internal 内部的

            - [X] International 国际的

            - [ ] Interfere 干涉, 冲突

        - [X] Beforehand 提前

        - [ ] Racial 种族的

        - [ ] Radiation 放射

        - [ ] Radical 激进

        - [X] Range 范围

        - [X] Wonder 惊奇

            - [X] Wander 迷失的

        - [ ] Isolate 隔离

        - [X] Issue 提出问题

        - [X] Hollow 洞

        - [X] Adequate 适用的

            - [X] Adapt 适应

            - [X] Adjust 调整

        - [ ] Adhere 坚持, 依附

        - [X] Capture 捕获

        - [X] Valid 有效的

        - [X] Valley 山谷

        - [ ] Consistent 一致的

        - [X] Continual 继续

    - [X] 100 - 120 [1/1]
        - [X] Explode 爆炸
            - [X] Explore 探索
------------------------------------------------------------


**** LOOP [#C] 高中 3500 单词快速过：所有单词看一遍能知道中文意思
DEADLINE: <2022-12-10 Sat> SCHEDULED: <2022-12-02 Fri>

- [ ] <2022-12-11 Sun 15:00> 一个小时背倒数 2 篇  

:LOGBOOK:
CLOCK: [2022-12-08 Thu 16:23]--[2022-12-08 Thu 17:25] =>  1:02
CLOCK: [2022-12-07 Tue 00:01]--[2022-12-07 Wed 01:05] =>  1:04
CLOCK: [2022-12-06 Tue 23:31]--[2022-12-06 Wed 23:50] =>  0:19
CLOCK: [2022-12-04 Sun 00:37]--[2022-12-04 Sun 01:43] =>  1:06
CLOCK: [2022-12-03 Sat 21:30]--[2022-12-03 Sat 21:46] =>  0:16
CLOCK: [2022-12-03 Sat 21:14]--[2022-12-03 Sat 21:30] =>  0:16
CLOCK: [2022-12-03 Sat 20:21]--[2022-12-03 Sat 20:59] =>  0:38
CLOCK: [2022-12-03 Sat 15:19]--[2022-12-03 Sat 17:07] =>  1:48
CLOCK: [2022-12-03 Sat 15:03]--[2022-12-03 Sat 15:19] =>  0:16
CLOCK: [2022-12-02 Fri 22:25]--[2022-12-02 Fri 22:43] =>  0:18 
CLOCK: [2022-12-02 Fri 21:26]--[2022-12-02 Fri 22:15] =>  0:49
:END:

- [X] 预习。              ：明白目标，调整方向，预计时间
    - [X] 时间安排

      必须 20 分钟一页，一小时 3 页，18 个小时，那么只要一天 6 小时，3 天足矣

    - [X] 目标：

      所有单词看一遍能知道中文意思。

    - [X] 资料

      https://zhuanlan.zhihu.com/p/125155772 知乎的简化版
      https://pan.baidu.com/link/zhihu/7VhXzeuZhTiWeoFUhzaE53ZzXUTPVVcQQ4t0== 百度网盘直接预览

- [-] 1 页
    - [ ] abandon 抛弃
    - [ ] ability 能力
    - [ ] able 能够
    - [ ] abnormal 不正常的
    - [ ] aboard 在船上
    - [ ] absent 缺席的
    - [ ] absence 缺席的
    - [ ] abolish 废弃
    - [ ] absolute 完全的，绝对的
    - [ ] abstract 抽象的
    - [ ] absurd 荒唐的 
    - [ ] abundant 大量的
    - [ ] activity 活动
    - [ ] actor 男角色
    - [ ] advertisement 广告
    - [ ] adapt 适应
    - [ ] adjust 调整
    - [ ] adjustment 调整
    - [ ] adequate 足够的
    - [ ] add 增加
    - [ ] addict 上瘾的
    - [ ] admire 赞扬
    - [ ] admirable 赞扬的
    - [ ] admission 进入权, 准入的  
    - [ ] admit 准许
    - [ ] abuse 滥用的
    - [ ] academe 学术的
    - [X] academic 学术的
    - [X] adopt 领养的
    - [X] adult 成年人

- [ ] 2 页
    - [ ] agress 侵入
    - [ ] aggressive 侵入
    - [ ] ago  岁
    - [ ] agree 同意
    - [ ] culture 文化
    - [ ] agricultural 农业的
    - [ ] agriculture 农业
    - [ ] ahead 领先
    - [ ] aid 救援
    - [ ] aircraft 飞机  
    - [ ] airline 航空公司
    - [ ] airmail 航空邮件
    - [ ] airplane 飞机
    - [ ] amount 数目
    - [ ] among 在 .. 中间
    - [ ] amuse 娱乐
    - [ ] amusement 娱乐
    - [ ] analyse 分析
    - [ ] analysis 分析
    - [ ] ancident 古代的
    - [ ] anger n 愤怒
    - [ ] angry adj 
    - [ ] annoy 厌烦的 
    - [ ] annual 年刊
    - [ ] ant 蚂蚁
    - [ ] answer 回答
    - [ ] alive 生存的
    - [ ] alike 相同的
    - [ ] alcohol 酒精 
    - [ ] alarm 警告
    - [ ] album 相簿

--------------------------------------------


*** 学习通 (打算这个星期写完，所以划分 6 个子任务）
**** DONE [#B] 单词
DEADLINE: <2022-12-03 Sat 12:00> SCHEDULED: <2022-12-03 Sat>
:LOGBOOK:
CLOCK: [2022-12-05 Mon 16:13]--[2022-12-05 Mon 17:08] =>  0:55
CLOCK: [2022-12-05 Mon 14:10]--[2022-12-05 Mon 15:12] =>  1:02
CLOCK: [2022-12-03 Sat 11:20]--[2022-12-03 Sat 12:03] =>  0:43
CLOCK: [2022-12-03 Sat 09:11]--[2022-12-03 Sat 10:05] =>  0:54
CLOCK: [2022-11-29 Tue 19:34]--[2022-11-29 Tue 19:42] =>  0:08
:END:
- [X] 预习
    - [X] 目标：快速学会四级常用词汇

    - [X] 资料
      http://mooc2-ans.gdhkmooc.com/mycourse/stu?courseid=227272645&clazzid=64261625&cpi=82748476&enc=060b3b94cb1f79b11b9040ee185f76c8&t=1668065307830&pageHeader=8&v=0 学习通网站

    - [X] 时间安排：最快

----------


**** 最快入门方法之语感训练 
- [-] 任务

  比起无脑背诵 3500 单词, 这样练更加容易掌握大纲和脉络, 更快速成,

    - [X] 翻译:把中文翻译成英文
    - [X] 作文:直接写英文

- [X] 学习方法
    - [X] 仿写英文句子
    - [X] 听力, 能大致听懂意思
    - [X] 读陌生单词, 从而读懂音标
    - [X] 背诵, 学会朗诵

***** LOOP [#C] 翻译
DEADLINE: <2022-12-16 Fri> SCHEDULED: <2022-12-03 Sat>

- [ ] <2022-12-11 Sun 19:00> 每天半小时

:LOGBOOK:
CLOCK: [2022-12-08 Thu 20:45]--[2022-12-08 Thu 21:30] =>  0:45
CLOCK: [2022-12-06 Tue 09:18]--[2022-12-06 Tue 09:51] =>  0:33
:END:

- [X] 学习目标
    - 现在这个阶段就是以模仿别人的写法为主, 不用太在意他们为什么不用你那种中式去翻译, 主要是练习语感
    - 辅助听力, 要听懂

- [X] 卢沟桥

      卢沟桥位于天安门广场西南 15 公里处，横跨永定河，是北京现存最古老的多拱石桥。
      卢沟桥最初建成于 1192 年 ， 1698 年重建，由 281 根柱子支撑。每根柱子上都有一头石狮。
      这些石狮的头、背、腹部或爪子上都藏着更多的狮子。这些石狮生动逼真、千姿百态，是
      卢沟桥石刻艺术的精品。桥上的石狮不计其数，因而北京地区流传着“卢沟桥上的石狮子数不清”的说法。

--------------------------------------------


***** LOOP [#C] 写作
DEADLINE: <2022-12-18 Sun> SCHEDULED: <2022-12-04 Sun>

- [ ] <2022-12-11 Sun 19:30> 每天半小时

:LOGBOOK:
CLOCK: [2022-12-08 Thu 21:34]--[2022-12-08 Thu 22:55] =>  1:21
CLOCK: [2022-12-06 Tue 09:53]--[2022-12-06 Tue 10:18] =>  0:25
:END:

- [-] 给学校图书管的建议

    - [X] 资料
      http://mooc1.gdhkmooc.com/mooc2/work/dowork?courseId=227272645&classId=64261625&cpi=82748476&workId=22844483&answerId=51558925&standardEnc=1a6f94578fc1024bd591be4fd7db7805&enc=ce5d4b9918b95afc46186590ce14e229

    - [X] 开头
    - [ ] ???
    - [ ] ???

---------


**** LOOP [#C] 选词填空
DEADLINE: <2022-12-20 Tue> SCHEDULED: <2022-12-04 Sun>
-----------------------------


**** DONE [#C] 阅读理解
SCHEDULED: <2022-12-05 Mon> DEADLINE: <2022-12-05 Mon 12:00>
:LOGBOOK:
CLOCK: [2022-12-05 Mon 13:47]--[2022-12-05 Mon 14:07] =>  0:20
CLOCK: [2022-12-05 Mon 12:23]--[2022-12-05 Mon 12:51] =>  0:28
:END:


**** LOOP [#C] 听力
DEADLINE: <2022-12-22 Thu> SCHEDULED: <2022-12-05 Mon>


*** DONE [#C] 英语课文复习（能复习多少算多少）
:LOGBOOK:
CLOCK: [2022-12-05 Mon 18:03]--[2022-12-05 Mon 18:46] =>  0:43
CLOCK: [2022-12-05 Mon 17:17]--[2022-12-05 Mon 18:03] =>  0:46
:END:
- [X] 题型

    - [X] 完形填空

    - [X] 从课文把句子抄上去

    - [X] 判断对错

    - [X] 另类写作题

        - [X] 根据课文内讨论题，写下你的想法

        - [X] 解决课文难题
          
- [X] 题型总结

    - 单词

    - 课文意思理解

    - 写作

    - 翻译

- [ ] 通过互联网找到科技英语的教材和背后习题答案

    - [ ] 教材是方便快速翻译

    - [ ] 答案是为了防止搜索引擎直接搜不到答案

- [ ] 四级

    - 听力（不用）

    - 阅读理解

    - 10 选 5

    - 翻译

    - 作文
---------------


*** DONE [#A] 考场考试
DEADLINE: <2022-12-05 Mon 21:00> SCHEDULED: <2022-12-05 Mon 19:00>
:LOGBOOK:
CLOCK: [2022-12-05 Mon 18:51]--[2022-12-05 Mon 20:37] =>  1:46
:END:


** 职业规划
*** DONE [#B] 职业规划书，手写 1500 字
DEADLINE: <2022-11-29 Mon 12:00> SCHEDULED: <2022-11-29 Tue 08:00>
:LOGBOOK:
CLOCK: [2022-11-29 Tue 14:20]--[2022-11-29 Tue 15:57] =>  1:37
CLOCK: [2022-11-29 Tue 13:10]--[2022-11-29 Tue 13:55] =>  0:45
CLOCK: [2022-11-29 Tue 11:10]--[2022-11-29 Tue 13:06] =>  1:56
:END:
直接抄网上的吧，艹，写条毛啊
https://www.yjbys.com/jiuyezhidao/zhiyeguihua/1888438.html
------------------------------------------------------


*** DONE [#B] 职业规划书籍和补修表和询问如何录入成绩
DEADLINE: <2022-11-29 Mon 16:00> SCHEDULED: <2022-11-29 Tue 14:00>
:LOGBOOK:
CLOCK: [2022-11-29 Tue 15:58]--[2022-11-29 Tue 16:32] =>  0:34
:END:


* 办理补修
** DONE 填写并且上交所有《就业表》和《档案》
DEADLINE: <2022-10-20 Thu 18:00>
:LOGBOOK:
CLOCK: [2022-10-22 Sat 15:10]--[2022-10-22 Sat 15:10] =>  0:00
:END:


** DONE 找到具体的任课老师和开课教研室
DEADLINE: <2022-10-18 Tue 17:00>


** DONE 找教务员商量高等数学和线性代数补修适宜
DEADLINE: <2022-10-18 Tue 16:00>


** DONE 去快递点拿表，然后签名好
DEADLINE: <2022-10-18 Mon 11:00>


** DONE 上交签好的软件工程和科技英语。没签的置换表，和补修表
DEADLINE: <2022-10-18 Tue 10:00>


** DONE 打印和填好免修，补修表：
DEADLINE: <2022-10-17 Mon 16:00>


** DONE 核对要补修和置换的科目
DEADLINE: <2022-10-17 Mon 12:00>
[[~/tmp/补修和置换.org]]


** DONE 把所有要做的作业，考试，日期，计划核对清楚
DEADLINE: <2022-10-17 Mon 12:00>
- [X] 形式与政策
- [X] 科技文献检索
- [X] 安卓作业
  - [X] 1-7
  - [X] 8
- [X] 安卓实训
- [X] 软件定义网络
  - [X] 实训验收
  - [X] 链接上传
- [X] 无线网络技术


** DONE 马克思新青年老师签名
DEADLINE: <2022-10-24 Mon 20:50>


** DONE 马克思学院教务处签名
SCHEDULED: <2022-10-25 Tue 16:05> DEADLINE: <2022-10-25 Tue 16:30>


** DONE 创业教研室签名
DEADLINE: <2022-10-25 Tue 16:00> SCHEDULED: <2022-10-25 Tue 15:30>


** DONE 一次上交剩余补修签名（马克思）
DEADLINE: <2022-10-25 Tue 17:00> SCHEDULED: <2022-10-25 Tue 16:40>



* 办理课程置换
** TASK [#B] 置换：计算机教研室


** TASK [#B] 置换：军训教研室


** TASK [#B] 置换：教育心理教研室


* 毕业相关事情
** TASK [#B] 三张表


** LOOP [#B] 公选课
DEADLINE: <2022-12-10 Sat> SCHEDULED: <2022-11-28 Mon>
:LOGBOOK:
CLOCK: [2022-11-30 Wed 11:51]--[2022-11-30 Wed 12:11] =>  0:20
:END:
- 中华民族精神

    - https://www.docin.com/p-2646997224.html 准确率还行，4 题 3 题有答案；免费。
      
    - https://cn.bing.com/search?q=超星尔雅中华民族精神答案&qs=n&form=QBRE&sp=-1&pq=超星尔雅中华民族精神答案&sc=1-12&sk=&cvid=55E64F5A61454032A366F080826522B6&ghsh=0&ghacc=0&ghpl= 必应关键字搜索
      
- 文化遗产概括

    - https://www.18183.com/zqnews/rjjc/202101/3215980.html 免费；准确率非常高

    - https://cn.bing.com/search?q=超星尔雅文化遗产概括答案&qs=n&form=QBRE&sp=-1&pq=超星尔雅文化遗产概括答案&sc=0-12&sk=&cvid=5360B368067346498F0E499016243D3A&ghsh=0&ghacc=0&ghpl= 必应关键字搜索

-----------------------------------------------------------------------------


** 素扩分
*** WAIT [#A] 献血
DEADLINE: <2022-12-11 Sun 09:30> SCHEDULED: <2022-12-11 Sun 8:30>
-----------


*** DONE 艾滋病问卷调查 0.4 
DEADLINE: <2022-11-29 Tue 00:45>
:LOGBOOK:
CLOCK: [2022-11-29 Tue 00:14]--[2022-11-29 Tue 01:29] =>  1:15
:END:


*** DONE [#B] 写征文活动：疫情防控
DEADLINE: <2022-12-02 Tue> SCHEDULED: <2022-12-01 Mon>
:LOGBOOK:
CLOCK: [2022-12-02 Fri 12:26]--[2022-12-02 Fri 14:41] =>  2:15
CLOCK: [2022-12-01 Thu 12:51]--[2022-12-01 Thu 16:51] =>  4:00
:END:
[[~/code/pirture/tmp/lasjdlkfj.txt]]
800 字数
标题: 宋体 3 号
内容: 宋体 4 号
单倍行距
正文写明作者姓名, 学号, 班级, 联系方式
文件名字: 素拓征文 + 班级 + 姓名
jisuanjisutuo2019@163.com
网络工程 19-2 

------------------------------------------------------


*** DONE [#B] 写征文活动：爱国
DEADLINE: <2022-12-03 Sat> SCHEDULED: <2022-12-02 Fri>
:LOGBOOK:
CLOCK: [2022-12-02 Fri 15:20]--[2022-12-02 Fri 18:30] =>  3:10
:END:
[[~/code/pirture/tmp/素拓征文-爱国.txt]]
--------------------------------------


*** DONE [#B] 禁毒调研答题竞赛
DEADLINE: <2022-12-03 Sat 23:00> SCHEDULED: <2022-12-02 Fri>
:LOGBOOK:
CLOCK: [2022-12-02 Fri 20:50]--[2022-12-02 Fri 21:08] =>  0:18
:END:

------------------------------------------------


*** DONE [#B] 艾滋病参加官网竞赛
SCHEDULED: <2022-12-25 Sun> DEADLINE: <2022-12-30 Fri>
-----------------------------------------------------


** 软著
*** DONE 打听最迟补办时间和费用
DEADLINE: <2022-10-24 Mon 18:00>
每个 300 块钱，一个抵消 5 分，最多抵消 10 分，3 月份前办好


*** TASK [#B] 搞张新银行卡


*** TASK [#B] 购买软著


*** TASK [#B] 上交软著
